from aiogram.types import ReplyKeyboardMarkup, KeyboardButton

# categories = ["Аніме 🍥", "Фільми 🎬", "Книги 📚"]
categories = ["Аніме", "Фільми", "Книги", "Моя статистика"]

actions = {
    "Аніме": ["Додати аніме", "Редагувати аніме", "Видалити аніме", "Переглянути список аніме", "Експортувати аніме", "Імпортувати аніме", "Назад"],
    "Фільми": ["Додати фільм", "Редагувати фільм", "Видалити фільм", "Переглянути список фільмів", "Експортувати фільми", "Імпортувати фільми", "Назад"],
    "Книги": ["Додати книгу", "Редагувати книгу", "Видалити книгу", "Переглянути список книг", "Експортувати книги", "Імпортувати книги", "Назад"],
    "Моя статистика": ["Переглянути статистику", "Назад"]
}

CATEGORY_LABELS = {
    "anime": "Аніме",
    "movie": "Фільми",
    "book": "Книги"
}
STATUS_LABELS = {
    "Заплановано": "Заплановано",
    "Дивлюсь": "Дивлюсь",
    "Переглянуто": "Переглянуто"
}


def get_keyboard(array):
    return ReplyKeyboardMarkup(
        keyboard=[[KeyboardButton(text=cat)] for cat in array],
        resize_keyboard=True
    )
